GeorgeIoak/Arduino/hardware/arduino/avr/boards.txt
##############################################################

trinket3.name=Adafruit Trinket 8MHz
trinket3.upload.tool=avrdude
trinket3.upload.protocol=usbtiny
trinket3.upload.maximum_size=5310
trinket3.upload.speed=9600
trinket3.bootloader.tool=avrdude
trinket3.bootloader.low_fuses=0xF1
trinket3.bootloader.high_fuses=0xD5
trinket3.bootloader.extended_fuses=0xFE
trinket3.build.mcu=attiny85
trinket3.build.vid=0x0c9f
trinket3.build.pid=0x1781
trinket3.build.usb_product="Trinket"
trinket3.build.usb_manufacturer="Adafruit"
trinket3.build.f_cpu=8000000L
trinket3.build.core=arduino:arduino
trinket3.build.variant=arduino:tiny8
trinket3.build.extra_flags={build.usb_flags}

##############################################################

trinket5.name=Adafruit Trinket 16MHz
trinket5.upload.tool=avrdude
trinket5.upload.protocol=usbtiny
trinket5.upload.maximum_size=5310
trinket5.upload.speed=9600
trinket5.bootloader.tool=avrdude
trinket5.bootloader.low_fuses=0xF1
trinket5.bootloader.high_fuses=0xD5
trinket5.bootloader.extended_fuses=0xFE
trinket5.build.mcu=attiny85
trinket5.build.vid=0x0c9f
trinket5.build.pid=0x1781
trinket5.build.usb_product="Trinket"
trinket5.build.usb_manufacturer="Adafruit"
trinket5.build.f_cpu=16000000L
trinket5.build.core=arduino:arduino
trinket5.build.variant=arduino:tiny8
trinket5.build.extra_flags={build.usb_flags}

##############################################################

gemma.name=Adafruit Gemma 8MHz
gemma.upload.tool=avrdude
gemma.upload.protocol=usbtiny
gemma.upload.maximum_size=5310
gemma.upload.speed=9600
gemma.bootloader.tool=avrdude
gemma.bootloader.low_fuses=0xF1
gemma.bootloader.high_fuses=0xD5
gemma.bootloader.extended_fuses=0xFE
gemma.build.mcu=attiny85
gemma.build.f_cpu=8000000L
gemma.build.core=arduino:arduino
gemma.build.variant=arduino:tiny8
gemma.build.extra_flags={build.usb_flags}

##############################################################

flora8.name=Adafruit Flora
flora8.upload.tool=avrdude
flora8.upload.protocol=avr109
flora8.upload.maximum_size=28672
flora8.upload.speed=57600
flora8.upload.disable_flushing=true
flora8.bootloader.low_fuses=0xff
flora8.bootloader.high_fuses=0xd8
flora8.bootloader.extended_fuses=0xcb
flora8.bootloader.file=caterina/Caterina-Flora8.hex
flora8.bootloader.unlock_bits=0x3F
flora8.bootloader.lock_bits=0x2F
flora8.build.mcu=atmega32u4
flora8.build.f_cpu=8000000L
flora8.build.vid=0x239A
flora8.build.pid=0x8004
flora8.build.usb_product="Adafruit Flora"
flora8.build.usb_manufacturer="Adafruit"
flora8.build.core=arduino:arduino
flora8.build.variant=arduino:flora8
flora8.build.extra_flags={build.usb_flags}
